app/controllers/compras_controller.rb

  def index
    @compras = Compra.all
---
SELECT "compras".* FROM "compras"

  def create
    @compra = Compra.new(compra_params)

    respond_to do |format|
      if @compra.save
---
INSERT INTO "compras" ("Numero_tarjeta", "Nombre_titular", "Fecha_de_vencimiento_tarjeta", "Codigo_seguridad", "Numero_cuotas", "created_at", "updated_at", "Placa_asociada") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    respond_to do |format|
      if @compra.update(compra_params)
---
UPDATE "compras" SET "id_seguro" = $1, "updated_at" = $2 WHERE "compras"."id" = $3  [["id_seguro", 49], ["updated_at", "2019-05-24 23:30:14.289232"], ["id", 2]]

    def set_compra
      @compra = Compra.find(params[:id])
---
SELECT  "compras".* FROM "compras" WHERE "compras"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]