app/controllers/polizas_controller.rb

SELECT "polizas".* FROM "polizas"
---
  def index
    @polizas = Poliza.all

INSERT INTO "polizas" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Poliza1"], ["created_at", "2019-05-23 07:24:41.917526"], ["updated_at", "2019-05-23 07:24:41.917526"]]
---
  def create
    @poliza = Poliza.new(poliza_params)

    respond_to do |format|
      if @poliza.save

SELECT  "polizas".* FROM "polizas" WHERE "polizas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_poliza
      @poliza = Poliza.find(params[:id])