app/controllers/seguros_controller.rb

SELECT "seguros".* FROM "seguros"
---
  def index
    @seguros = Seguro.all

INSERT INTO "seguros" ("Placa_del_vehiculo", "Fecha_inicio_vigencia", "Fecha_fin_vigencia", "Numero_pasajeros", "Cilindraje", "Clase", "Toneladas", "Edad", "Precio", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
  def create
    @seguro = Seguro.new(seguro_params)

    respond_to do |format|
      if @seguro.save

DELETE FROM "seguros" WHERE "seguros"."id" = $1  [["id", 19]]
---
  def destroy
    @seguro.destroy

SELECT  "seguros".* FROM "seguros" WHERE "seguros"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_seguro
      @seguro = Seguro.find(params[:id])