app/controllers/soatseguros_controller.rb

SELECT "soatseguros".* FROM "soatseguros"
---
  def index
    @soatseguros = Soatseguro.all