app/controllers/users_controller.rb

INSERT INTO "users" ("username", "created_at", "updated_at", "password", "rol", "email") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["username", "lau"], ["created_at", "2019-05-23 06:14:32.813073"], ["updated_at", "2019-05-23 06:14:32.813073"], ["password", "1234"], ["rol", "Cliente"], ["email", "l@l.com"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "username" = $1, "Tipo_documento" = $2, "Numero_documento" = $3, "Apellidos" = $4, "Telefono" = $5, "updated_at" = $6 WHERE "users"."id" = $7  [["username", "Leo"], ["Tipo_documento", "CC"], ["Numero_documento", 1016283423], ["Apellidos", "Messi"], ["Telefono", 13123], ["updated_at", "2019-05-24 06:27:47.276206"], ["id", 15]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)